src/main/resources/request/SendAddVisitTasksRequestMessage.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mes="http://schemas.consiliumtechnologies.com/services/mobile/2009/03/messaging" xmlns:vis="http://schemas.consiliumtechnologies.com/mobile/2009/03/VisitsMessages.xsd" xmlns:vis1="http://schemas.consiliumtechnologies.com/mobile/2009/03/VisitsTypes.xsd" xmlns:com="http://schemas.consiliumtechnologies.com/mobile/2009/03/CommonTypes.xsd">
    <soapenv:Header/>
    <soapenv:Body>
        <mes:SendAddVisitTasksRequestMessage>
            <!--Optional:-->
            <mes:SendMessageRequestInfo>
                <mes:QueueName>?</mes:QueueName>
                <!--Optional:-->
                <mes:CorrelationId>?</mes:CorrelationId>
                <mes:Key>?</mes:Key>
            </mes:SendMessageRequestInfo>
            <!--Optional:-->
            <mes:AddVisitTasksRequest>
                <vis:Identity>
                    <!--Optional:-->
                    <vis1:Guid>?</vis1:Guid>
                    <vis1:WorkType>?</vis1:WorkType>
                    <vis1:User>
                        <!--Optional:-->
                        <com:Attributes>
                            <!--Zero or more repetitions:-->
                            <com:Attribute>
                                <!--Optional:-->
                                <com:Name>?</com:Name>
                                <!--Optional:-->
                                <com:Value>?</com:Value>
                            </com:Attribute>
                        </com:Attributes>
                        <!--Optional:-->
                        <com:ID>?</com:ID>
                        <!--Optional:-->
                        <com:Name>?</com:Name>
                        <!--Optional:-->
                        <com:DeviceID>?</com:DeviceID>
                    </vis1:User>
                    <!--Optional:-->
                    <vis1:Company>?</vis1:Company>
                    <vis1:Reference>?</vis1:Reference>
                </vis:Identity>
                <vis:Tasks>
                    <!--Zero or more repetitions:-->
                    <vis1:Task>
                        <vis1:LineNo>?</vis1:LineNo>
                        <vis1:Type>?</vis1:Type>
                        <vis1:Description>?</vis1:Description>
                        <!--Optional:-->
                        <vis1:Complete>?</vis1:Complete>
                        <!--Optional:-->
                        <vis1:Notes>?</vis1:Notes>
                        <!--Optional:-->
                        <vis1:Location>?</vis1:Location>
                        <vis1:Status>?</vis1:Status>
                        <!--Optional:-->
                        <vis1:AdditionalProperties>
                            <!--Zero or more repetitions:-->
                            <vis1:AdditionalProperty>
                                <vis1:Name>?</vis1:Name>
                                <vis1:Value>?</vis1:Value>
                                <!--Optional:-->
                                <vis1:AdditionalProperties/>
                            </vis1:AdditionalProperty>
                        </vis1:AdditionalProperties>
                    </vis1:Task>
                </vis:Tasks>
                <!--Optional:-->
                <vis:HasPendingTasks>?</vis:HasPendingTasks>
            </mes:AddVisitTasksRequest>
        </mes:SendAddVisitTasksRequestMessage>
    </soapenv:Body>
</soapenv:Envelope>